const area = [
  {
    'name': '山东省',
    'code': '370000',
    'region': 'east',
    'children': [
      {
        'name': '济南市',
        'code': '370100',
        'children': [
          {
            'name': '历下区',
            'code': '370102'
          },
          {
            'name': '市中区',
            'code': '370103'
          },
          {
            'name': '槐荫区',
            'code': '370104'
          },
          {
            'name': '天桥区',
            'code': '370105'
          },
          {
            'name': '历城区',
            'code': '370112'
          },
          {
            'name': '长清区',
            'code': '370113'
          },
          {
            'name': '章丘区',
            'code': '370114'
          },
          {
            'name': '济阳区',
            'code': '370115'
          },
          {
            'name': '莱芜区',
            'code': '370116'
          },
          {
            'name': '钢城区',
            'code': '370117'
          },
          {
            'name': '平阴县',
            'code': '370124'
          },
          {
            'name': '商河县',
            'code': '370126'
          }
        ]
      },
      {
        'name': '青岛市',
        'code': '370200',
        'children': [
          {
            'name': '市南区',
            'code': '370202'
          },
          {
            'name': '市北区',
            'code': '370203'
          },
          {
            'name': '黄岛区',
            'code': '370211'
          },
          {
            'name': '崂山区',
            'code': '370212'
          },
          {
            'name': '李沧区',
            'code': '370213'
          },
          {
            'name': '城阳区',
            'code': '370214'
          },
          {
            'name': '即墨区',
            'code': '370215'
          },
          {
            'name': '胶州市',
            'code': '370281'
          },
          {
            'name': '平度市',
            'code': '370283'
          },
          {
            'name': '莱西市',
            'code': '370285'
          }
        ]
      },
      {
        'name': '淄博市',
        'code': '370300',
        'children': [
          {
            'name': '淄川区',
            'code': '370302'
          },
          {
            'name': '张店区',
            'code': '370303'
          },
          {
            'name': '博山区',
            'code': '370304'
          },
          {
            'name': '临淄区',
            'code': '370305'
          },
          {
            'name': '周村区',
            'code': '370306'
          },
          {
            'name': '桓台县',
            'code': '370321'
          },
          {
            'name': '高青县',
            'code': '370322'
          },
          {
            'name': '沂源县',
            'code': '370323'
          }
        ]
      },
      {
        'name': '枣庄市',
        'code': '370400',
        'children': [
          {
            'name': '市中区',
            'code': '370402'
          },
          {
            'name': '薛城区',
            'code': '370403'
          },
          {
            'name': '峄城区',
            'code': '370404'
          },
          {
            'name': '台儿庄区',
            'code': '370405'
          },
          {
            'name': '山亭区',
            'code': '370406'
          },
          {
            'name': '滕州市',
            'code': '370481'
          }
        ]
      },
      {
        'name': '东营市',
        'code': '370500',
        'children': [
          {
            'name': '东营区',
            'code': '370502'
          },
          {
            'name': '河口区',
            'code': '370503'
          },
          {
            'name': '垦利区',
            'code': '370505'
          },
          {
            'name': '利津县',
            'code': '370522'
          },
          {
            'name': '广饶县',
            'code': '370523'
          }
        ]
      },
      {
        'name': '烟台市',
        'code': '370600',
        'children': [
          {
            'name': '芝罘区',
            'code': '370602'
          },
          {
            'name': '福山区',
            'code': '370611'
          },
          {
            'name': '牟平区',
            'code': '370612'
          },
          {
            'name': '莱山区',
            'code': '370613'
          },
          {
            'name': '长岛县',
            'code': '370634'
          },
          {
            'name': '龙口市',
            'code': '370681'
          },
          {
            'name': '莱阳市',
            'code': '370682'
          },
          {
            'name': '莱州市',
            'code': '370683'
          },
          {
            'name': '蓬莱市',
            'code': '370684'
          },
          {
            'name': '招远市',
            'code': '370685'
          },
          {
            'name': '栖霞市',
            'code': '370686'
          },
          {
            'name': '海阳市',
            'code': '370687'
          }
        ]
      },
      {
        'name': '潍坊市',
        'code': '370700',
        'children': [
          {
            'name': '潍城区',
            'code': '370702'
          },
          {
            'name': '寒亭区',
            'code': '370703'
          },
          {
            'name': '坊子区',
            'code': '370704'
          },
          {
            'name': '奎文区',
            'code': '370705'
          },
          {
            'name': '临朐县',
            'code': '370724'
          },
          {
            'name': '昌乐县',
            'code': '370725'
          },
          {
            'name': '青州市',
            'code': '370781'
          },
          {
            'name': '诸城市',
            'code': '370782'
          },
          {
            'name': '寿光市',
            'code': '370783'
          },
          {
            'name': '安丘市',
            'code': '370784'
          },
          {
            'name': '高密市',
            'code': '370785'
          },
          {
            'name': '昌邑市',
            'code': '370786'
          }
        ]
      },
      {
        'name': '济宁市',
        'code': '370800',
        'children': [
          {
            'name': '任城区',
            'code': '370811'
          },
          {
            'name': '兖州区',
            'code': '370812'
          },
          {
            'name': '微山县',
            'code': '370826'
          },
          {
            'name': '鱼台县',
            'code': '370827'
          },
          {
            'name': '金乡县',
            'code': '370828'
          },
          {
            'name': '嘉祥县',
            'code': '370829'
          },
          {
            'name': '汶上县',
            'code': '370830'
          },
          {
            'name': '泗水县',
            'code': '370831'
          },
          {
            'name': '梁山县',
            'code': '370832'
          },
          {
            'name': '曲阜市',
            'code': '370881'
          },
          {
            'name': '邹城市',
            'code': '370883'
          }
        ]
      },
      {
        'name': '泰安市',
        'code': '370900',
        'children': [
          {
            'name': '泰山区',
            'code': '370902'
          },
          {
            'name': '岱岳区',
            'code': '370911'
          },
          {
            'name': '宁阳县',
            'code': '370921'
          },
          {
            'name': '东平县',
            'code': '370923'
          },
          {
            'name': '新泰市',
            'code': '370982'
          },
          {
            'name': '肥城市',
            'code': '370983'
          }
        ]
      },
      {
        'name': '威海市',
        'code': '371000',
        'children': [
          {
            'name': '环翠区',
            'code': '371002'
          },
          {
            'name': '文登区',
            'code': '371003'
          },
          {
            'name': '荣成市',
            'code': '371082'
          },
          {
            'name': '乳山市',
            'code': '371083'
          }
        ]
      },
      {
        'name': '日照市',
        'code': '371100',
        'children': [
          {
            'name': '东港区',
            'code': '371102'
          },
          {
            'name': '岚山区',
            'code': '371103'
          },
          {
            'name': '五莲县',
            'code': '371121'
          },
          {
            'name': '莒县',
            'code': '371122'
          }
        ]
      },
      {
        'name': '临沂市',
        'code': '371300',
        'children': [
          {
            'name': '兰山区',
            'code': '371302'
          },
          {
            'name': '罗庄区',
            'code': '371311'
          },
          {
            'name': '河东区',
            'code': '371312'
          },
          {
            'name': '沂南县',
            'code': '371321'
          },
          {
            'name': '郯城县',
            'code': '371322'
          },
          {
            'name': '沂水县',
            'code': '371323'
          },
          {
            'name': '兰陵县',
            'code': '371324'
          },
          {
            'name': '费县',
            'code': '371325'
          },
          {
            'name': '平邑县',
            'code': '371326'
          },
          {
            'name': '莒南县',
            'code': '371327'
          },
          {
            'name': '蒙阴县',
            'code': '371328'
          },
          {
            'name': '临沭县',
            'code': '371329'
          }
        ]
      },
      {
        'name': '德州市',
        'code': '371400',
        'children': [
          {
            'name': '德城区',
            'code': '371402'
          },
          {
            'name': '陵城区',
            'code': '371403'
          },
          {
            'name': '宁津县',
            'code': '371422'
          },
          {
            'name': '庆云县',
            'code': '371423'
          },
          {
            'name': '临邑县',
            'code': '371424'
          },
          {
            'name': '齐河县',
            'code': '371425'
          },
          {
            'name': '平原县',
            'code': '371426'
          },
          {
            'name': '夏津县',
            'code': '371427'
          },
          {
            'name': '武城县',
            'code': '371428'
          },
          {
            'name': '乐陵市',
            'code': '371481'
          },
          {
            'name': '禹城市',
            'code': '371482'
          }
        ]
      },
      {
        'name': '聊城市',
        'code': '371500',
        'children': [
          {
            'name': '东昌府区',
            'code': '371502'
          },
          {
            'name': '阳谷县',
            'code': '371521'
          },
          {
            'name': '莘县',
            'code': '371522'
          },
          {
            'name': '茌平县',
            'code': '371523'
          },
          {
            'name': '东阿县',
            'code': '371524'
          },
          {
            'name': '冠县',
            'code': '371525'
          },
          {
            'name': '高唐县',
            'code': '371526'
          },
          {
            'name': '临清市',
            'code': '371581'
          }
        ]
      },
      {
        'name': '滨州市',
        'code': '371600',
        'children': [
          {
            'name': '滨城区',
            'code': '371602'
          },
          {
            'name': '沾化区',
            'code': '371603'
          },
          {
            'name': '惠民县',
            'code': '371621'
          },
          {
            'name': '阳信县',
            'code': '371622'
          },
          {
            'name': '无棣县',
            'code': '371623'
          },
          {
            'name': '博兴县',
            'code': '371625'
          },
          {
            'name': '邹平市',
            'code': '371681'
          }
        ]
      },
      {
        'name': '菏泽市',
        'code': '371700',
        'children': [
          {
            'name': '牡丹区',
            'code': '371702'
          },
          {
            'name': '定陶区',
            'code': '371703'
          },
          {
            'name': '曹县',
            'code': '371721'
          },
          {
            'name': '单县',
            'code': '371722'
          },
          {
            'name': '成武县',
            'code': '371723'
          },
          {
            'name': '巨野县',
            'code': '371724'
          },
          {
            'name': '郓城县',
            'code': '371725'
          },
          {
            'name': '鄄城县',
            'code': '371726'
          },
          {
            'name': '东明县',
            'code': '371728'
          }
        ]
      }
    ]
  },
  {
    'name': '河北省',
    'code': '130000',
    'region': 'north',
    'children': [
      {
        'name': '石家庄市',
        'code': '130100',
        'children': [
          {
            'name': '长安区',
            'code': '130102'
          },
          {
            'name': '桥西区',
            'code': '130104'
          },
          {
            'name': '新华区',
            'code': '130105'
          },
          {
            'name': '井陉矿区',
            'code': '130107'
          },
          {
            'name': '裕华区',
            'code': '130108'
          },
          {
            'name': '藁城区',
            'code': '130109'
          },
          {
            'name': '鹿泉区',
            'code': '130110'
          },
          {
            'name': '栾城区',
            'code': '130111'
          },
          {
            'name': '井陉县',
            'code': '130121'
          },
          {
            'name': '正定县',
            'code': '130123'
          },
          {
            'name': '行唐县',
            'code': '130125'
          },
          {
            'name': '灵寿县',
            'code': '130126'
          },
          {
            'name': '高邑县',
            'code': '130127'
          },
          {
            'name': '深泽县',
            'code': '130128'
          },
          {
            'name': '赞皇县',
            'code': '130129'
          },
          {
            'name': '无极县',
            'code': '130130'
          },
          {
            'name': '平山县',
            'code': '130131'
          },
          {
            'name': '元氏县',
            'code': '130132'
          },
          {
            'name': '赵县',
            'code': '130133'
          },
          {
            'name': '辛集市',
            'code': '130181'
          },
          {
            'name': '晋州市',
            'code': '130183'
          },
          {
            'name': '新乐市',
            'code': '130184'
          }
        ]
      },
      {
        'name': '唐山市',
        'code': '130200',
        'children': [
          {
            'name': '路南区',
            'code': '130202'
          },
          {
            'name': '路北区',
            'code': '130203'
          },
          {
            'name': '古冶区',
            'code': '130204'
          },
          {
            'name': '开平区',
            'code': '130205'
          },
          {
            'name': '丰南区',
            'code': '130207'
          },
          {
            'name': '丰润区',
            'code': '130208'
          },
          {
            'name': '曹妃甸区',
            'code': '130209'
          },
          {
            'name': '滦南县',
            'code': '130224'
          },
          {
            'name': '乐亭县',
            'code': '130225'
          },
          {
            'name': '迁西县',
            'code': '130227'
          },
          {
            'name': '玉田县',
            'code': '130229'
          },
          {
            'name': '遵化市',
            'code': '130281'
          },
          {
            'name': '迁安市',
            'code': '130283'
          },
          {
            'name': '滦州市',
            'code': '130284'
          }
        ]
      },
      {
        'name': '秦皇岛市',
        'code': '130300',
        'children': [
          {
            'name': '海港区',
            'code': '130302'
          },
          {
            'name': '山海关区',
            'code': '130303'
          },
          {
            'name': '北戴河区',
            'code': '130304'
          },
          {
            'name': '抚宁区',
            'code': '130306'
          },
          {
            'name': '青龙满族自治县',
            'code': '130321'
          },
          {
            'name': '昌黎县',
            'code': '130322'
          },
          {
            'name': '卢龙县',
            'code': '130324'
          }
        ]
      },
      {
        'name': '邯郸市',
        'code': '130400',
        'children': [
          {
            'name': '邯山区',
            'code': '130402'
          },
          {
            'name': '丛台区',
            'code': '130403'
          },
          {
            'name': '复兴区',
            'code': '130404'
          },
          {
            'name': '峰峰矿区',
            'code': '130406'
          },
          {
            'name': '肥乡区',
            'code': '130407'
          },
          {
            'name': '永年区',
            'code': '130408'
          },
          {
            'name': '临漳县',
            'code': '130423'
          },
          {
            'name': '成安县',
            'code': '130424'
          },
          {
            'name': '大名县',
            'code': '130425'
          },
          {
            'name': '涉县',
            'code': '130426'
          },
          {
            'name': '磁县',
            'code': '130427'
          },
          {
            'name': '邱县',
            'code': '130430'
          },
          {
            'name': '鸡泽县',
            'code': '130431'
          },
          {
            'name': '广平县',
            'code': '130432'
          },
          {
            'name': '馆陶县',
            'code': '130433'
          },
          {
            'name': '魏县',
            'code': '130434'
          },
          {
            'name': '曲周县',
            'code': '130435'
          },
          {
            'name': '武安市',
            'code': '130481'
          }
        ]
      },
      {
        'name': '邢台市',
        'code': '130500',
        'children': [
          {
            'name': '桥东区',
            'code': '130502'
          },
          {
            'name': '桥西区',
            'code': '130503'
          },
          {
            'name': '邢台县',
            'code': '130521'
          },
          {
            'name': '临城县',
            'code': '130522'
          },
          {
            'name': '内丘县',
            'code': '130523'
          },
          {
            'name': '柏乡县',
            'code': '130524'
          },
          {
            'name': '隆尧县',
            'code': '130525'
          },
          {
            'name': '任县',
            'code': '130526'
          },
          {
            'name': '南和县',
            'code': '130527'
          },
          {
            'name': '宁晋县',
            'code': '130528'
          },
          {
            'name': '巨鹿县',
            'code': '130529'
          },
          {
            'name': '新河县',
            'code': '130530'
          },
          {
            'name': '广宗县',
            'code': '130531'
          },
          {
            'name': '平乡县',
            'code': '130532'
          },
          {
            'name': '威县',
            'code': '130533'
          },
          {
            'name': '清河县',
            'code': '130534'
          },
          {
            'name': '临西县',
            'code': '130535'
          },
          {
            'name': '南宫市',
            'code': '130581'
          },
          {
            'name': '沙河市',
            'code': '130582'
          }
        ]
      },
      {
        'name': '保定市',
        'code': '130600',
        'children': [
          {
            'name': '竞秀区',
            'code': '130602'
          },
          {
            'name': '莲池区',
            'code': '130606'
          },
          {
            'name': '满城区',
            'code': '130607'
          },
          {
            'name': '清苑区',
            'code': '130608'
          },
          {
            'name': '徐水区',
            'code': '130609'
          },
          {
            'name': '涞水县',
            'code': '130623'
          },
          {
            'name': '阜平县',
            'code': '130624'
          },
          {
            'name': '定兴县',
            'code': '130626'
          },
          {
            'name': '唐县',
            'code': '130627'
          },
          {
            'name': '高阳县',
            'code': '130628'
          },
          {
            'name': '容城县',
            'code': '130629'
          },
          {
            'name': '涞源县',
            'code': '130630'
          },
          {
            'name': '望都县',
            'code': '130631'
          },
          {
            'name': '安新县',
            'code': '130632'
          },
          {
            'name': '易县',
            'code': '130633'
          },
          {
            'name': '曲阳县',
            'code': '130634'
          },
          {
            'name': '蠡县',
            'code': '130635'
          },
          {
            'name': '顺平县',
            'code': '130636'
          },
          {
            'name': '博野县',
            'code': '130637'
          },
          {
            'name': '雄县',
            'code': '130638'
          },
          {
            'name': '涿州市',
            'code': '130681'
          },
          {
            'name': '定州市',
            'code': '130682'
          },
          {
            'name': '安国市',
            'code': '130683'
          },
          {
            'name': '高碑店市',
            'code': '130684'
          }
        ]
      },
      {
        'name': '张家口市',
        'code': '130700',
        'children': [
          {
            'name': '桥东区',
            'code': '130702'
          },
          {
            'name': '桥西区',
            'code': '130703'
          },
          {
            'name': '宣化区',
            'code': '130705'
          },
          {
            'name': '下花园区',
            'code': '130706'
          },
          {
            'name': '万全区',
            'code': '130708'
          },
          {
            'name': '崇礼区',
            'code': '130709'
          },
          {
            'name': '张北县',
            'code': '130722'
          },
          {
            'name': '康保县',
            'code': '130723'
          },
          {
            'name': '沽源县',
            'code': '130724'
          },
          {
            'name': '尚义县',
            'code': '130725'
          },
          {
            'name': '蔚县',
            'code': '130726'
          },
          {
            'name': '阳原县',
            'code': '130727'
          },
          {
            'name': '怀安县',
            'code': '130728'
          },
          {
            'name': '怀来县',
            'code': '130730'
          },
          {
            'name': '涿鹿县',
            'code': '130731'
          },
          {
            'name': '赤城县',
            'code': '130732'
          }
        ]
      },
      {
        'name': '承德市',
        'code': '130800',
        'children': [
          {
            'name': '双桥区',
            'code': '130802'
          },
          {
            'name': '双滦区',
            'code': '130803'
          },
          {
            'name': '鹰手营子矿区',
            'code': '130804'
          },
          {
            'name': '承德县',
            'code': '130821'
          },
          {
            'name': '兴隆县',
            'code': '130822'
          },
          {
            'name': '滦平县',
            'code': '130824'
          },
          {
            'name': '隆化县',
            'code': '130825'
          },
          {
            'name': '丰宁满族自治县',
            'code': '130826'
          },
          {
            'name': '宽城满族自治县',
            'code': '130827'
          },
          {
            'name': '围场满族蒙古族自治县',
            'code': '130828'
          },
          {
            'name': '平泉市',
            'code': '130881'
          }
        ]
      },
      {
        'name': '沧州市',
        'code': '130900',
        'children': [
          {
            'name': '新华区',
            'code': '130902'
          },
          {
            'name': '运河区',
            'code': '130903'
          },
          {
            'name': '沧县',
            'code': '130921'
          },
          {
            'name': '青县',
            'code': '130922'
          },
          {
            'name': '东光县',
            'code': '130923'
          },
          {
            'name': '海兴县',
            'code': '130924'
          },
          {
            'name': '盐山县',
            'code': '130925'
          },
          {
            'name': '肃宁县',
            'code': '130926'
          },
          {
            'name': '南皮县',
            'code': '130927'
          },
          {
            'name': '吴桥县',
            'code': '130928'
          },
          {
            'name': '献县',
            'code': '130929'
          },
          {
            'name': '孟村回族自治县',
            'code': '130930'
          },
          {
            'name': '泊头市',
            'code': '130981'
          },
          {
            'name': '任丘市',
            'code': '130982'
          },
          {
            'name': '黄骅市',
            'code': '130983'
          },
          {
            'name': '河间市',
            'code': '130984'
          }
        ]
      },
      {
        'name': '廊坊市',
        'code': '131000',
        'children': [
          {
            'name': '安次区',
            'code': '131002'
          },
          {
            'name': '广阳区',
            'code': '131003'
          },
          {
            'name': '固安县',
            'code': '131022'
          },
          {
            'name': '永清县',
            'code': '131023'
          },
          {
            'name': '香河县',
            'code': '131024'
          },
          {
            'name': '大城县',
            'code': '131025'
          },
          {
            'name': '文安县',
            'code': '131026'
          },
          {
            'name': '大厂回族自治县',
            'code': '131028'
          },
          {
            'name': '霸州市',
            'code': '131081'
          },
          {
            'name': '三河市',
            'code': '131082'
          }
        ]
      },
      {
        'name': '衡水市',
        'code': '131100',
        'children': [
          {
            'name': '桃城区',
            'code': '131102'
          },
          {
            'name': '冀州区',
            'code': '131103'
          },
          {
            'name': '枣强县',
            'code': '131121'
          },
          {
            'name': '武邑县',
            'code': '131122'
          },
          {
            'name': '武强县',
            'code': '131123'
          },
          {
            'name': '饶阳县',
            'code': '131124'
          },
          {
            'name': '安平县',
            'code': '131125'
          },
          {
            'name': '故城县',
            'code': '131126'
          },
          {
            'name': '景县',
            'code': '131127'
          },
          {
            'name': '阜城县',
            'code': '131128'
          },
          {
            'name': '深州市',
            'code': '131182'
          }
        ]
      }
    ]
  },
]

export default area
